{
	"_meta": {
		"sources": [
			{
				"json": "unlimitedpossibilities",
				"abbreviation": "UP",
				"full": "Unlimited Possibilities",
				"authors": [
					"Kaldigo"
				],
				"convertedBy": [
					"Kaldigo"
				],
				"version": "1.0",
				"url": ""
			}
		],
		"dateAdded": 1643685011,
		"dateLastModified": 1644095508
	},
	"subclass": [
		{
			"name": "Unlimited Possibilities Craftsman",
			"source": "upcraft",
			"className": "Craftsman",
			"classSource": "VSS",
			"shortName": "UP Craftsman",
			"subclassFeatures": [
				"Arcane Maesters' Guild|Craftsman|VSS|UP Craftsman|UP|3",
				"Forgeknights' Guild|Craftsman|VSS|UP Craftsman|UP|3",
				"Bladeworkers' Guild|Craftsman|VSS|UP Craftsman|UP|3",
				"Thunderlords' Guild|Craftsman|VSS|UP Craftsman|UP|3",
				"Instant Attunement|Craftsman|VSS|UP Craftsman|UP|7",
				"Forgefired Armory|Craftsman|VSS|UP Craftsman|UP|7",
				"Sabotaging Strike|Craftsman|VSS|UP Craftsman|UP|7",
				"Lightning Rod|Craftsman|VSS|UP Craftsman|UP|7",
				"Ephemeral Enchantment|Craftsman|VSS|UP Craftsman|UP|10",
				"Superheated Weapons|Craftsman|VSS|UP Craftsman|UP|10",
				"Honed Weapons|Craftsman|VSS|UP Craftsman|UP|10",
				"Static Charge|Craftsman|VSS|UP Craftsman|UP|10",
				"Sever Connection|Craftsman|VSS|UP Craftsman|UP|14",
				"Fire Burst|Craftsman|VSS|UP Craftsman|UP|14",
				"Versatile Weapon Master|Craftsman|VSS|UP Craftsman|UP|14",
				"High Voltage|Craftsman|VSS|UP Craftsman|UP|14",
				"Resonant|Craftsman|VSS|UP Craftsman|UP|18",
				"Forge Plate|Craftsman|VSS|UP Craftsman|UP|18",
				"Devastating|Craftsman|VSS|UP Craftsman|UP|18",
				"Electroshock|Craftsman|VSS|UP Craftsman|UP|18"
			]
		}
	],
	"subclassFeature": [
		{
			"name": "Arcane Maesters' Guild",
			"source": "VSS",
			"className": "Craftsman",
			"classSource": "VSS",
			"subclassShortName": "UP Craftsman",
			"subclassSource": "UPC",
			"level": 3,
			"entries": [
				"While most seasoned spellcasters will enchant a handful of magic items over the course of their careers, artisans belonging to the Guild of Arcane Maesters seek to become true masters of magic item creation. They rightly take seriously the forging of such powerful relics: each creation must be a masterwork in its own right to contain the potent magic woven into them. Despite laboring for months or even years to perfect their creations, seasoned maesters are always seen to be laden with dozens of magic items, attuned to a handful of rings, and carrying a {@item wand of magic missiles}, just in case.",
				{
					"type": "refSubclassFeature",
					"subclassFeature": "Magic Item Crafting|Craftsman|VSS|UP Craftsman|UP|3"
				},
				{
					"type": "refSubclassFeature",
					"subclassFeature": "Apprentice Property|Craftsman|VSS|UP Craftsman|UP|3"
				}
			]
		},
		{
			"name": "Magic Item Crafting",
			"source": "VSS",
			"className": "Craftsman",
			"classSource": "VSS",
			"subclassShortName": "UP Craftsman",
			"subclassSource": "UPC",
			"level": 3,
			"entries": [
				"When you join this guild at 3rd level, you unlock the secrets of crafting items infused with magical energy. The Magic Item Crafting sidebar details the magic items you can create, specifies the level you must reach in this class to create each magic item, and shows the cost in materials an item will require. You can craft a magic item by spending multiple days working on it, as per the Active Crafting feature.",
				"From among those available at 3rd level, you can craft 5 magic items. You can craft 3 from among those available at 7th, 3 from among those at 10th, and 2 from among those at 14th. In the process of creating a new magic item, you can dismantle a magic item you have created in order to build a new one from the same category.",
				{
					"type": "inset",
					"name": "Magic Item Crafting",
					"entries": [
						"The following lists show which magic items you can create, the craftsman level you must reach and the cost in materials each item requires.",
						"{@b 3RD LEVEL - 100 GP}",
						"{@item Bag of holding}",
						"{@item Decanter of endless water}",
						"{@item Eyes of minute seeing}",
						"{@item Folding boat}",
						"{@item Goggles of night}",
						"{@item Handy haversack}",
						"{@item Helm of comprehending}",
						"{@item languages}",
						"{@item Immovable rod}",
						"{@item Lantern of revealing}",
						"{@item Periapt of health}",
						"{@item Rope of climbing}",
						"{@item Wand of secrets}",
						"{@b 7TH LEVEL - 250 GP}",
						"{@item Boots of elvenkiind}",
						"{@item Circlet of blasting}",
						"{@item Cloak of elvenkind}",
						"{@item Efficient quiver}",
						"{@item Eyes of charming}",
						"{@item Pipes of haunting}",
						"{@item Portable hole}",
						"{@item Ring of jumping}",
						"{@item Ring of water walking}",
						"{@item Wand of magic missiles}",
						"{@item Wind fan}",
						"{@b 10TH LEVEL - 500 GP}",
						"{@item Boots of striding and springing}",
						"{@item Eversmoking bottle}",
						"{@item Eyes of the eagle}",
						"{@item Gloves of missile snaring}",
						"{@item Hat of disguise}",
						"{@item Helm of telepathy}",
						"{@item Periapt of proof against poison}",
						"{@item Periapt of wound closure}",
						"{@item Ring of feather falling}",
						"{@item Ring of mind shielding}",
						"{@item Slippers of spider climbing}",
						"{@item Winged boots}",
						"{@b 14TH LEVEL - 1,000 GP}",
						"{@item Belt of dwarvenkind}",
						"{@item Boots of levitation}",
						"{@item Boots of speed}",
						"{@item Cape of the mountebank}",
						"{@item Cloak of the bat}",
						"{@item Gem of seeing}",
						"{@item Horn of blasting}",
						"{@item Instant fortress}",
						"{@item Iron bands of binding}",
						"{@item Ring of free action}",
						"{@item Ring of the ram}",
						"{@item Ring of X-ray vision}",
						"{@item Wand of enemy detection}",
						"{@item Wand of fear}"
					]
				},
				{
					"type": "inset",
					"name": "Magic Item Blueprints",
					"entries": [
						"If you wish to craft an item not included on the Magic Item Crafting sidebar, you might find a blueprint for such an item on your travels. The GM will determine the craftsman level and cost in materials required for a magic item created from a blueprint. Unless otherwise stated, a blueprint can only be used to create one magic item."
					]
				}
			]
		},
		{
			"name": "Apprentice Property",
			"source": "VSS",
			"className": "Craftsman",
			"classSource": "VSS",
			"subclassShortName": "UP Craftsman",
			"subclassSource": "UPC",
			"level": 3,
			"entries": [
				"Also at 3rd level, you learn to apply the following masterwork property to your equipment:",
				{
					"type": "entries",
					"name": "Enchanted",
					"entries": [
						"{@i Apprentice weapon property}",
						"{@b Components:} Masterwork weapon",
						"This weapon is interwoven with strong magical enchantments. You can use your Intelligence, instead of Strength or Dexterity, for this weapon's attack and damage rolls."
					]
				}
			]
		},
		{
			"name": "Instant Attunement",
			"source": "VSS",
			"className": "Craftsman",
			"classSource": "VSS",
			"subclassShortName": "UP Craftsman",
			"subclassSource": "UPC",
			"level": 7,
			"header": 2,
			"entries": [
				"Beginning at 7th level, your experience in creating magic items allows you to quickly bond with them. You can use your action to attune to a magic item, and you can end your attunement to an item as part of the same action. You can use this ability a number of times equal to your Intelligence modifier, and you regain all expended uses when you finish a short or long rest."
			]
		},
		{
			"name": "Ephemeral Enchantment",
			"source": "VSS",
			"className": "Craftsman",
			"classSource": "VSS",
			"subclassShortName": "UP Craftsman",
			"subclassSource": "UPC",
			"level": 10,
			"header": 2,
			"entries": [
				"Starting at 10th level, you can spend 10 minutes to lay an enchantment on a nonmagical weapon, enchanting up to 6 nonmagical weapons during a short or long rest. For the next 8 hours, each enchanted weapon counts as magical for the purpose of overcoming damage resistance and immunity to nonmagical attacks and damage."
			]
		},
		{
			"name": "Sever Connection",
			"source": "VSS",
			"className": "Craftsman",
			"classSource": "VSS",
			"subclassShortName": "UP Craftsman",
			"subclassSource": "UPC",
			"level": 14,
			"header": 2,
			"entries": [
				"By 14th level, you can break the connection that binds you to your magic items and repurpose that magic to protect yourself. As a reaction when a creature you can see targets you with an attack, or when you make a saving throw, you can end your attunement to one magic item. Until the start of your next turn, you gain a bonus to your Armor Class and saving throws equal to your Intelligence modifier. The total number of magic items you can attune to is reduced by 1 until you finish a short or long rest.",
				"Once you use this feature, you can't use it again until you finish a short or long rest."
			]
		},
		{
			"name": "Resonant",
			"source": "VSS",
			"className": "Craftsman",
			"classSource": "VSS",
			"subclassShortName": "UP Craftsman",
			"subclassSource": "UPC",
			"level": 18,
			"header": 2,
			"entries": [
				"{@i Legendary armor property}",
				"{@b Components:} Masterwork suit of exotic armor",
				"By spending a short rest focusing on a magic item while wearing this armor, you can attune the item directly to the armor. You can use the magic item as though you were attuned to it while you are wearing the armor. You can attune up to two items to the armor, and can end an item's attunement to the armor by spending another short rest focused on the item."
			]
		},
		{
			"name": "Forgeknights' Guild",
			"source": "VSS",
			"className": "Craftsman",
			"classSource": "VSS",
			"subclassShortName": "UP Craftsman",
			"subclassSource": "UPC",
			"level": 3,
			"entries": [
				"To a Forgeknight, heat is not merely integral to forging, curing, and welding gear, it is a weapon in its own right, for the swing of a white-hot blade bites not only with steel, but with flame. A Forgeknight carries the intensity of a forge with them, storing it in their armor and building it up in their weapons, before unleashing it in a scorching blast.",
				{
					"type": "refSubclassFeature",
					"subclassFeature": "Portable Forge|Craftsman|VSS|UP Craftsman|UP|3"
				}
			]
		},
		{
			"name": "Portable Forge",
			"source": "VSS",
			"className": "Craftsman",
			"classSource": "VSS",
			"subclassShortName": "UP Craftsman",
			"subclassSource": "UPC",
			"level": 3,
			"entries": [
				"When you join this guild at 3rd level, you construct a portable forge which allows you to heat objects you are forging without a specially constructed shop or foundry. When you gain this forge, you are assumed to have been working on it in your spare time, only bringing it to full functionality when you take this subclass. If your forge is ever lost or damaged, you can repair or replace it over the course of a long rest with 100 gp of materials.",
				"While you are carrying your forge, you gain the following benefits:",
				{
					"type": "list",
					"items": [
						"Weapons you wield can deal fire damage instead of their normal damage type.",
						"You have resistance to fire damage.",
						"You can cast the cantrips {@spell mending} and {@spell produce flame}. Intelligence is your spellcasting ability for each of these spells."
					]
				}
			]
		},
		{
			"name": "Forgefired Armory",
			"source": "VSS",
			"className": "Craftsman",
			"classSource": "VSS",
			"subclassShortName": "UP Craftsman",
			"subclassSource": "UPC",
			"level": 7,
			"header": 2,
			"entries": [
				"Starting at 7th level, you can add the Explosive and Heat properties to your exotic melee weapons. You can add the Heat property to any melee weapon, even if it already has another Journeyman property. When you hit a target with an explosive melee weapon, it creates an explosion at the point of impact, as per the Explosive property, which doesn't harm you or the weapon.",
				{
					"type": "entries",
					"name": "Heat",
					"entries": [
						"This weapon gains a heat point whenever an attack is made with it and loses one heat point whenever you begin your turn. If the weapon gains 3 heat points, it overheats and loses all heat points. An overheated weapon can't be used to make an attack again until the end of your next turn."
					]
				},
				{
					"type": "entries",
					"name": "Explosive",
					"entries": [
						"When this weapon's projectile hits a target, it explodes in a 15-foot diameter sphere. The projectile can target an unoccupied space within its range. Each creature other than the target within the blast radius (for a Medium or smaller target, each creature within 5 feet of it) must succeed on a Dexterity saving throw, taking half the damage rolled on a failed save or no damage on a successful one."
					]
				}
			]
		},
		{
			"name": "Superheated Weapons",
			"source": "VSS",
			"className": "Craftsman",
			"classSource": "VSS",
			"subclassShortName": "UP Craftsman",
			"subclassSource": "UPC",
			"level": 10,
			"header": 2,
			"entries": [
				"Starting at 10th level, you can plunge a number of melee weapons or pieces of ammunition into an active forge or your portable forge, heating them to white-hot temperatures. Weapons and ammunition placed in the forge must be made of metal, and remain heated for 10 minutes. You can heat one weapon or 2 pieces of ammunition in the forge as an action, or up to 10 weapons or 20 pieces of ammunition over the course of 1 minute.",
				"The first time a heated weapon or piece of ammunition hits a target, it deals an extra 1d6 fire damage and is no longer heated."
			]
		},
		{
			"name": "Fire Burst",
			"source": "VSS",
			"className": "Craftsman",
			"classSource": "VSS",
			"subclassShortName": "UP Craftsman",
			"subclassSource": "UPC",
			"level": 14,
			"header": 2,
			"entries": [
				"Beginning at 14th level, you can release the heat of your portable forge in a colossal burst. While holding your forge, you can cast the {@spell fireball} spell, centered on yourself, without using a spell slot or material components, using your Masterwork save DC. You take no damage from this spell.",
				"Once you use this feature, you can't use it again until you finish a short or long rest."
			]
		},
		{
			"name": "Forge Plate",
			"source": "VSS",
			"className": "Craftsman",
			"classSource": "VSS",
			"subclassShortName": "UP Craftsman",
			"subclassSource": "UPC",
			"level": 18,
			"header": 2,
			"entries": [
				"{@i Legendary armor property}",
				"{@b Components:} Masterwork suit of exotic heavy armor",
				"You build a miniature furnace into this suit of armor, as well as layers of heat-dispersing materials. While wearing this armor, you have immunity to fire damage.",
				"Additionally, when you take the Dash action, you can choose to cast the {@spell wall of fire} spell without using a spell slot or spell components as part of that action. The wall appears at the end of your turn. Instead of creating a straight or ringed wall of fire, the wall follows the path along the ground over which you moved on your turn, up to a distance of 60 feet. Once you use this property, you can't use it again until you finish a short or long rest."
			]
		},
		{
			"name": "Bladeworkers' Guild",
			"source": "VSS",
			"className": "Craftsman",
			"classSource": "VSS",
			"subclassShortName": "UP Craftsman",
			"subclassSource": "UPC",
			"level": 3,
			"entries": [
				"Blade and bow, axe and mace: these are the tools with which the Bladeworkers try to change the world. They believe that the right blade, in the right hand can make a warrior unstoppable.",
				{
					"type": "refSubclassFeature",
					"subclassFeature": "Fighting Style|Craftsman|VSS|UP Craftsman|UP|3"
				}
			]
		},
		{
			"name": "Fighting Style",
			"source": "VSS",
			"className": "Craftsman",
			"classSource": "VSS",
			"subclassShortName": "UP Craftsman",
			"subclassSource": "UPC",
			"level": 3,
			"entries": [
				"Starting when you choose this guild at 3rd level, you not only learn to forge great weapons, you fight with them as well. Choose one of the following options. You can't take a Fighting Style option more than once, even if you later get to choose again.",
				{
					"type": "entries",
					"name": "Dueling",
					"entries": [
						"When you are wielding a melee weapon in one hand and no other weapons, you gain a +2 bonus to damage rolls with that weapon."
					]
				},
				{
					"type": "entries",
					"name": "Great Weapon Fighting",
					"entries": [
						"When you roll a 1 or 2 on a damage die for an attack you make with a melee weapon that you are wielding with two hands, you can reroll the die and must use the new roll, even if the new roll is a 1 or a 2. The weapon must have the Two-Handed or Versatile property for you to gain this benefit."
					]
				},
				{
					"type": "entries",
					"name": "Hand-and-a-Half",
					"entries": [
						"While wielding a versatile weapon in two hands, you gain a +1 bonus to attack and damage rolls with that weapon."
					]
				},
				{
					"type": "entries",
					"name": "Two-Weapon Fighting",
					"entries": [
						"When you engage in two-weapon fighting, you can add your ability modifier to the damage of the second attack."
					]
				}
			]
		},
		{
			"name": "Sabotaging Strike",
			"source": "VSS",
			"className": "Craftsman",
			"classSource": "VSS",
			"subclassShortName": "UP Craftsman",
			"subclassSource": "UPC",
			"level": 7,
			"header": 2,
			"entries": [
				"Beginning at 7th level, you can use your knowledge of armament construction to disarm your foes and crush their armor. Once on each of your turns, when you take the Attack action, you can replace one of your attacks with one of the following special melee attacks.",
				{
					"type": "entries",
					"name": "Disarm",
					"entries": [
						"You attempt to disarm a target within your reach. The target makes a Strength saving throw against your Masterwork save DC. On a failed save, it drops one item of your choice that it is holding or carrying. The object lands at its feet."
					]
				},
				{
					"type": "entries",
					"name": "Sunder",
					"entries": [
						"You attempt to shatter the defenses of a target within your reach that is wearing armor or carrying a shield. The target must make a Dexterity saving throw against your Masterwork save DC. On a failed save, the target's armor or shield takes a permanent and cumulative −1 penalty to the AC it offers. Armor reduced to an AC of 10 or a shield that drops to a +0 bonus is destroyed. If a creature's armor or shield is damaged but not destroyed, it can repair it over the course of a short or long rest."
					]
				}
			]
		},
		{
			"name": "Honed Weapons",
			"source": "VSS",
			"className": "Craftsman",
			"classSource": "VSS",
			"subclassShortName": "UP Craftsman",
			"subclassSource": "UPC",
			"level": 10,
			"header": 2,
			"entries": [
				"Starting at 10th level, you can spend 10 minutes to fortify a weapon, or fortify up to 6 weapons during a short or long rest. This weapon retains its fortification until it hits a target, after which it is no longer fortified. A fortified weapon gains one of the following properties of your choice:",
				{
					"type": "entries",
					"name": "Honed",
					"entries": [
						"This weapon has a +2 bonus to attack rolls."
					]
				},
				{
					"type": "entries",
					"name": "Sharpened",
					"entries": [
						"This weapon deals an extra {@dice 1d8} damage on a hit."
					]
				}
			]
		},
		{
			"name": "Versatile Weapon Master",
			"source": "VSS",
			"className": "Craftsman",
			"classSource": "VSS",
			"subclassShortName": "UP Craftsman",
			"subclassSource": "UPC",
			"level": 14,
			"header": 2,
			"entries": [
				"By 14th level, you can wield all manner of weapons in rapid succession. Once on each of your turns when you attack with a weapon, you can gain advantage on the attack roll. You can use this ability four times: once to make a ranged weapon attack with a weapon that has the Ammunition property, once to make a melee weapon attack with a twohanded weapon, once to make a melee weapon attack with a one-handed weapon, and once to make a ranged weapon attack with a thrown weapon. Each use must be with a different weapon, and you regain each use of this ability after one minute. You can't use this ability if you have disadvantage on the attack roll, or if you can't see the target."
			]
		},
		{
			"name": "Devastating",
			"source": "VSS",
			"className": "Craftsman",
			"classSource": "VSS",
			"subclassShortName": "UP Craftsman",
			"subclassSource": "UPC",
			"level": 18,
			"header": 2,
			"entries": [
				"{@i Legendary weapon property}",
				"{@b Components:} Masterwork exotic weapon",
				"This weapon scores a critical hit on a roll of 18–20."
			]
		},
		{
			"name": "Thunderlords' Guild",
			"source": "VSS",
			"className": "Craftsman",
			"classSource": "VSS",
			"subclassShortName": "UP Craftsman",
			"subclassSource": "UPC",
			"level": 3,
			"entries": [
				"From the earliest days of life, storms (and particularly lightning) have struck the creatures caught in them with awe and terror. The Thunderlords, by contrast, draw wild inspiration from the majesty of nature, and seek to, quite literally, capture lightning in a bottle.",
				{
					"type": "refSubclassFeature",
					"subclassFeature": "Power Cell|Craftsman|VSS|UP Craftsman|UP|3"
				},
				{
					"type": "refSubclassFeature",
					"subclassFeature": "Shock|Craftsman|VSS|UP Craftsman|UP|3"
				}
			]
		},
		{
			"name": "Power Cell",
			"source": "VSS",
			"className": "Craftsman",
			"classSource": "VSS",
			"subclassShortName": "UP Craftsman",
			"subclassSource": "UPC",
			"level": 3,
			"entries": [
				"Starting when you join this guild at 3rd level, you construct a lightning-generating power cell, which comes connected to a set of conduit gauntlets. When you gain these items, you are assumed to have been working on them in your spare time, only bringing them to full functionality when you choose this subclass. If these pieces of equipment are lost or damaged, you can replace them over the course of a long rest with 100 gp worth of materials.",
				{
					"type": "entries",
					"name": "Charge Points",
					"entries": [
						"Your power cell gives you a number of charge points, which represent the electrical energy stored within your power cell. Your maximum number of charge points is equal to half your craftsman level, rounded up. You can spend these points to generate various electrical effects through your power cell. You regain all expended charge points when you finish a short or long rest."
					]
				},
				{
					"type": "entries",
					"name": "Using Charge Points",
					"entries": [
						"Once per turn when you hit a creature with an attack that deals lightning damage, you can spend 1 or more charge points, up to a maximum number equal to your proficiency bonus, to enhance the power of the attack. When you do so, choose one of the following effects:",
						{
							"type": "entries",
							"name": "Arc",
							"entries": [
								"Lightning arcs to nearby targets. Choose a number of creatures equal to the number of charge points you spend that are within 15 feet of the target of your attack. Each of the chosen creatures must make a Dexterity saving throw against your Masterwork save DC. On a failed save, a creature takes lightning damage equal to {@dice 1d6} + your Intelligence modifier."
							]
						},
						{
							"type": "entries",
							"name": "Discharge",
							"entries": [
								"The creature you hit takes an extra {@dice 1d6} lightning damage for each charge point you spend."
							]
						},
						{
							"type": "entries",
							"name": "Jolt",
							"entries": [
								"The creature you hit can't take reactions until the start of your next turn."
							]
						}
					]
				}
			]
		},
		{
			"name": "Shock",
			"source": "VSS",
			"className": "Craftsman",
			"classSource": "VSS",
			"subclassShortName": "UP Craftsman",
			"subclassSource": "UPC",
			"level": 3,
			"entries": [
				"At 3rd level, while you are carrying your power cell and it has at least 1 unspent charge point, you gain the following benefits:",
				{
					"type": "list",
					"items": [
						"Weapons you wield can deal lightning damage instead of their normal damage type.",
						"You know the {@spell shocking grasp} and {@spell spare the dying} cantrips. Intelligence is your spellcasting ability for these spells."
					]
				}
			]
		},
		{
			"name": "Lightning Rod",
			"source": "VSS",
			"className": "Craftsman",
			"classSource": "VSS",
			"subclassShortName": "UP Craftsman",
			"subclassSource": "UPC",
			"level": 7,
			"header": 2,
			"entries": [
				"Starting at 7th level, while you're carrying your power cell, you have resistance to lightning damage. Additionally, whenever you take lightning damage from a hostile creature while wearing your gauntlets, you can regain 2 expended charge points as a reaction."
			]
		},
		{
			"name": "Static Charge",
			"source": "VSS",
			"className": "Craftsman",
			"classSource": "VSS",
			"subclassShortName": "UP Craftsman",
			"subclassSource": "UPC",
			"level": 10,
			"header": 2,
			"entries": [
				"Starting at 10th level, you can spend 10 minutes to store an electric charge in a weapon or suit of armor, or you can store an electric charge in up to 6 different weapons or suits of armor during a short or long rest. Unexpended charges dissipate after 1 hour. A charged weapon or suit of armor gains the following appropriate property:",
				{
					"type": "entries",
					"name": "Charged Armor",
					"entries": [
						"When you take damage from a melee attack, you can use your reaction to expend the charge, dealing {@dice 1d8} lightning damage to the creature that hit you."
					]
				},
				{
					"type": "entries",
					"name": "Charged Weapon",
					"entries": [
						"When you hit a creature with an attack using this weapon, you can expend the charge to deal an extra 1d6 lightning damage to the target."
					]
				}
			]
		},
		{
			"name": "High Voltage",
			"source": "VSS",
			"className": "Craftsman",
			"classSource": "VSS",
			"subclassShortName": "UP Craftsman",
			"subclassSource": "UPC",
			"level": 14,
			"header": 2,
			"entries": [
				"Starting at 14th level, while carrying your power cell, you can spend 5 charge points to cast the {@spell lightning bolt} spell without using a spell slot or material components. This spell uses your Masterwork save DC."
			]
		},
		{
			"name": "Electroshock",
			"source": "VSS",
			"className": "Craftsman",
			"classSource": "VSS",
			"subclassShortName": "UP Craftsman",
			"subclassSource": "UPC",
			"level": 18,
			"header": 2,
			"entries": [
				"{@i Legendary weapon property}",
				"{@b Components:} Masterwork exotic weapon",
				"When you hit a creature with this weapon, you can expend the weapon's built-in power cell to shock the target. The target must succeed on a Constitution saving throw against your Masterwork save DC or become {@condition stunned} until the end of your next turn.",
				"Once you use this property, you can't use it again with this weapon until you finish a short or long rest."
			]
		}
	]
}